<template>
	<div class="mygoldbean">
		<div class="header"><div tag="div" class="back" @click="back"><i></i>返回</div>金豆列表</div>
		<div class="block"></div>
		<div class="wrapper" :style="{'top': '44px'}">
			<group gutter="0">
				<cell title="我的金豆" :value="memberInfo.goldBean"></cell>
			</group>
			<div class="goldList">
				<p class="litleTitle">金豆列表</p>
				<div class="goldUl vux-1px-t vux-1px-b">
					<div class="goldLi vux-1px-b" v-for="(item,i) in list" :key="i">
						<img class="icon" src="../assets/img/goldbean.svg">
						<p class="num">{{item.num}}金豆<span class="rmb">¥{{item.num/100}}</span></p>
						<div class="btn">
							<x-button type="primary" mini @click.native="showPayToast(item.num)">&nbsp;获取&nbsp;</x-button>
						</div>
					</div>
				</div>
			</div>
			<div v-show="showPay" class="dialog-mask"></div>
			<div v-show="showPay" class="dialog">
				<div class="closeDialog" @click="showPay = false"></div>
				<div class="dialog-title">
					<strong>获取金豆</strong>
				</div>
				<p class="goldNum">{{payNum}}金豆</p>
				<div style="padding:15px;">
					<x-button @click.native="buyGoldBean" type="primary" :disabled="!isAgree">立即支付{{payNum / 100}}元</x-button>
					<p class="tips" @click="isTipsInfoShow = !isTipsInfoShow">您将先充值钻石，充值后自动兑换<i></i></p>
					<div class="tipsInfo" v-show="isTipsInfoShow">
						<p class="tipsInfoDetail">你充值钻石时，将自动兑换鲜花道具增加魅力值，
	同时附赠金豆，魅力值可点击用户头像查看，使用金豆参加游戏。（1元=10钻，自动兑换鲜花道具增加1魅力值，同时附赠100金豆。）</p>
					</div>
					<div class="agreement vux-1px-t">
						<check-icon :value.sync="isAgree"></check-icon>
						<span @click="showAgreement = true">我已经阅读并同意《91疯狂猜服务协议》</span>
					</div>
				</div>
			</div>
			<div v-show="showAgreement" class="agreementDialog">
				<div class="closeAgreementDialog" @click="showAgreement = false"></div>
				<div class="agreementDialog-title vux-1px-b">
					<strong>91疯狂猜服务协议</strong>
				</div>
				<div style="padding:15px;height:90%">
					<p style="height: 100%;overflow: auto;text-align:left">
《健康游戏忠告》<br>
抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。
合理安排时间，享受健康生活。倡导理性消费 享受竞技快乐。<br>
一、协议总则<br>
1. 本《用户协议》为玩家（即用户）就深圳猜个球网络科技有限公司（以下简称猜个球公司）所提供的服务达成的用户协议。猜个球公司在此特别提醒用户认真阅读、充分理解本《用户服务协议》（下称《用户协议》）--- 用户应认真阅读、充分理解本《用户协议》中各条款，特别涉及免除或者限制猜个球公司责任的免责条款，对用户的权利限制的条款，法律适用、争议解决方式的条款。<br>
2. 请用户审慎阅读并选择同意或不同意本《用户协议》，除非用户接受本《用户协议》所有条款，否则用户无权下载、安装、升级、登陆、显示、运行、截屏等方式使用本软件及其相关服务。用户的下载、安装、显示、帐号获取和登录、截屏等行为表明用户自愿接受本用户协议的全部内容并受其约束，不得以任何理由包括但不限于未能认真阅读本用户协议等作为纠纷抗辩理由。<br>
3. 本《用户协议》可由猜个球公司随时更新，更新后的用户协议条款一旦公布即代替原来的用户协议条款，不再另行个别通知。用户可重新下载安装本软件或网站查阅最新版用户协议条款。在猜个球公司修改《用户协议》条款后，如果用户不接受修改后的条款，请立即停止使用猜个球公司提供的软件和服务，用户继续使用猜个球公司提供的软件和服务将被视为已接受了修改后的用户协议。<br>
4. 本《用户协议》内容包括但不限于本用户协议以下内容，针对某些具体服务所约定的管理办法、公告、重要提示、指引、说明等均为本用户协议的补充内容，为本用户协议不可分割之组成部分，具有本用户协议同等法律效力，接受本用户协议即视为用户自愿接受以上管理办法、公告、重要提示、指引、说明等并受其约束；否则请用户立即停止使用猜个球公司提供的软件和服务。<br>
5. 本公司只为用户提供本责任条款内声明的管理服务项目，并保留在非正常情况下有可能导致网站部分功能暂时中断的临时调整处理权，例如网络或服务器故障、计算 机程式错误、外来非法程序入侵、自然灾害、相关国家法律政策变动等，并对此类情况所造成的任何用户帐号资料损失不承担赔偿责任，用户游戏帐号资料将在数据 安全机制范围内受到尽可能完善的保护和备份，用户无权单方面要求帐号资料恢复到某状态。<br>
二、特殊规定<br>
1. 未满十八周岁的未成年人应经其监护人陪同阅读本服务条款并表示同意，方可接受本服务条款。监护人应加强对未成年人的监督和保护，因其未谨慎履行监护责任而损害未成年人利益或者影响猜个球公司利益的，应由监护人承担责任。<br>
2. 青少年用户应遵守全国青少年网络文明公约：要善于网上学习，不浏览不良信息；要诚实友好交流，不侮辱欺诈他人；要增强自护意识，不随意约会网友；要维护网络安全，不破坏网络秩序；要有益身心健康，不沉溺虚拟时空。<br>
三、91疯狂猜权利声明<br>
1. 猜个球公司拥有向最终用户提供内容服务的、网址中包含www.91fkc.com的互联网网站、以及《91疯狂猜》网络游戏平台（以下简称《91疯狂猜》）及其服务器端、最终客户端程序、文档的（包括上述内容的升级、改进版本）的所有权和一切知识产权，包括但不限于：<br>
（1）《91疯狂猜》软件及其他物品的著作权、版权、名称权、商标权以及由其派生的各项权利；<br>
（2）《91疯狂猜》中的电子文档、文字、数据库、图片、图标、图示、照片、程序、音乐、色彩、版面设计、界面设计等可从作品中单独使用的作品元素的著作权、版权、名称权、商标权以及由其派生的各项权利；<br>
（3）猜个球公司向用户提供服务过程中所产生并存储于猜个球公司系统中的任何数据（包括但不限于账号、元宝、经验值、级别等游戏数据）的所有权。<br>
（4）用户在使用《91疯狂猜》游戏过程中产生的电子文档、文字、图片、照片、色彩、游戏界面等可以单独使用的游戏元素，以及由其形成的截屏、录像、录音等衍生品的各项权利。<br>
2. 上述权利猜个球公司书面授权用户以非商业、不损害猜个球公司利益的目的临时的、有限的、不可转让的使用权。用户不得为商业运营目的安装、使用、运行“91疯狂猜”，不可以对该软件或者该软件运行过程中释放到任何计算机终端内存中的数据及该软件运行过程中客户端与服务器端的交互数据进行复制、更改、修改、挂接运行或创作任何衍生作品，形式包括但不限于使用截屏、插件、外挂或非经授权的第三方工具/服务接入本“软件”和相关系统。<br>
3. 未经猜个球公司书面同意，用户以任何营利性、非营利性或损害猜个球公司利益的目的实施以下几种行为的，猜个球公司保留追究上述未经许可行为一切法律责任的权利，给猜个球公司造成经济或名誉上损失的，猜个球公司有权根据相关法律法规另行要求赔偿，情节严重涉嫌犯罪的，猜个球公司将提交司法机关追究刑事责任：<br>
（1）进行编译、反编译等方式破解该软件作品的行为；<br>
（2）利用技术手段破坏软件系统或者服务器的行为；<br>
（3）利用游戏外挂、作弊软件、系统漏洞侵犯猜个球公司利益的行为；<br>
（4）对游戏进行截屏、录像或利用游戏中数据、图片、截屏进行发表的行为；<br>
（5）其他严重侵犯猜个球公司知识产权的行为。<br>
四、用户基本权利和责任<br>
1.  用户享有由猜个球公司根据实际情况提供的各种服务，包括但不限于线上游戏、网上论坛、举办活动等。在某些情况下，猜个球公司许可用户以其91疯狂猜账号登录或使用猜个球公司合作方运营的产品或服务。<br>
2.  用户认为自己在游戏中的权益受到侵害，有权根据猜个球公司相关规定进行投诉申诉。<br>
3.  用户有权对猜个球公司的管理和服务提出批评、意见、建议，有权就客户服务相关工作向客服提出咨询。<br>
4.  用户在《91疯狂猜》的游戏活动应遵守中华人民共和国法律、法规，遵守猜个球公司的相关管理规定（包括但不限于管理办法、禁止性和限制性行为等），并自行承担因游戏活动直接或间接引起的一切法律责任。<br>
5.  用户有权自主选择依照游戏设定的方式和规则进行竞赛或游戏，对其游戏活动产生的损失，包括经济损失和精神损害承担相应责任。猜个球公司就用户的游戏的行为、活动、交易或利用《91疯狂猜》进行的非法活动不承担任何责任。<br>
6.  用户需遵守网络道德，注意网络礼仪，做到文明上网。<br>
7.  猜个球公司仅提供相关的网络服务，除此之外与相关网络服务有关的上网设备(如电脑、调制解调器及其他互联网接入装置)及所需的费用（如为接入互联网而支付的电话费、上网费）均应由用户自行负担。<br>
8.  用户在使用91疯狂猜的收费功能时，应当按照91疯狂猜的要求支付相应的费用。而且，该等权利属于91疯狂猜的经营自主权，91疯狂猜保留随时改变经营模式的权利，即保留变更收费的费率标准、收费的软件功能、收费对象及收费时间等权利。同时，91疯狂猜也保留对91疯狂猜进行升级、改版，增加、删除、修改、变更其功能或者变更其游戏规则的权利。用户如果不接受该等变更的，应当立即停止使用91疯狂猜；用户继续使用91疯狂猜大厅和/或91疯狂猜的行为，视为用户接受改变后的经营模式。<br>
9. 基于本《用户协议》及其补充用户协议，用户可以：<br>
（1）接收、下载、安装、启动、升级、登录、显示、运行和/或截屏91疯狂猜；<br>
（2）创建91疯狂猜游戏角色，设置网名，查阅游戏规则、用户个人资料、游戏对局结果，开设游戏房间、使用聊天功能，在游戏中购买、赠送富贵豆、游戏道具；<br>
（3）使用91疯狂猜上列功能之外的其他的某一项或某几项功能。<br>
10. 用户除了可以按照本《用户协议》的约定使用91疯狂猜之外，不得进行任何侵犯91疯狂猜或其软件要素作品的知识产权的行为，或者进行其他的有损于91疯狂猜或其他用户合法权益的行为。91疯狂猜也绝对不会允许用户从事这些行为，亦有权采取技术措施防止用户从事这些行为，包括但不限于：<br>
（1）删除或修改91疯狂猜上的版权信息，或者伪造ICP/IP地址或者数据包的名称；<br>
（2）进行编译、反编译、反向工程或者以其他方式破解91疯狂猜的行为；<br>
（3）进行任何破坏91疯狂猜公平性或者其他影响游戏正常秩序的行为，如主动或被动刷分、合伙作弊、使用游戏外挂或者其他的作弊软件、利用BUG（又叫“漏洞”或者“缺陷”）来获得不正当的非法利益，或者利用互联网或其他方式将游戏外挂、作弊软件、BUG公之于众；<br>
（4）利用劫持域名服务器等技术非法侵入、破坏91疯狂猜服务器软件系统，或者修改、增加、删除、窃取、截留、替换91疯狂猜之客户端和/或服务器软件系统中的数据，或者非法挤占91疯狂猜服务器空间，或者实施其他的使之超负荷运行的行为；<br>
（5）进行任何诸如发布广告、销售商品的商业行为，或者进行任何非法的侵害91疯狂猜利益的行为，如贩卖外挂、富贵豆、游戏道具、游戏装备等；<br>
（6）冒充91疯狂猜的游戏管理员或91疯狂猜游戏论坛管理员、版主发布任何诈骗或虚假信息；<br>
（7）利用91疯狂猜故意传播恶意程序或计算机病毒，或者利用91疯狂猜发表、转发、传播侵犯第三方知识产权、肖像权、姓名权、名誉权、隐私或其他合法权益的文字、图片、照片、程序、视频、图象和/或动画等资料，发布假冒91疯狂猜官方网站网址或链接。<br>
11. 91疯狂猜可能会通过91疯狂猜官方网站、91疯狂猜客服官方网站、客服电话、91疯狂猜游戏论坛、游戏管理员或者其他的途径，向用户提供诸如游戏规则说明、BUG或外挂投诉、游戏物品找回、游戏账号锁定或解除锁定、游戏帐号申诉、91疯狂猜游戏帐号暂时封停、91疯狂猜游戏帐号实名注册信息修改和/或查验等客户服务，用户应当：<br>
（1）通过91疯狂猜客服官方网站、91疯狂猜客服服务电话或者91疯狂猜提供的其他途径了解这些客户服务的内容、要求以及资费，谨慎选择是否需要享受相应的客户服务，向91疯狂猜真实地准确地表达用户的需求；<br>
（2）不得在接受91疯狂猜提供的服务的过程中进行本《用户协议》第12条所述行为；<br>
（3）同意并接受91疯狂猜关于该等客户服务的专门用户协议或条款；<br>
（4）按照91疯狂猜的要求如实提供用户的包括有效身份信息在内的个人信息和游戏情况，及用户掌握的其他用户或91疯狂猜本身的情况，例如：用户的个人资料、91疯狂猜的登录情况和游戏物品情况，91疯狂猜当中存在的BUG、外挂及用户知晓的其他玩家使用BUG或外挂的情况。<br>
12.  91疯狂猜将会尽最大的努力提高客户服务的质量、满足用户的服务要求。即便是如此，91疯狂猜仍保留向用户收取相应的服务费或者其他报酬的权利，而且不保证其提供的服务就一定能够满足用户的要求。<br>
13.  91疯狂猜官方网站通过文字、图片或者其他形式，向用户介绍91疯狂猜的游戏规则。91疯狂猜亦是按照这种游戏规则设计、开发的。用户是完全同意并承诺按照这种游戏规则进行相应的游戏的；用户如果不同意，请用户不要下载、安装、启动、登录、显示、运行91疯狂猜，用户下载、安装、启动、登录、显示和/或运行的行为，即视为用户同意并接受这些游戏规则。<br>
14.  如果在使用和享受91疯狂猜产品及服务的过程中，用户发现91疯狂猜完全或者部分不能实现91疯狂猜所介绍的对应的游戏规则的，请用户立即停止使用不符合游戏规则的这一部分游戏内容或者游戏区域，并在第一时间内通知91疯狂猜，91疯狂猜将会尽快进行修复，使之符合这些游戏规则。<br>
15.  用户在进行、使用推广系统时，应遵守“推广规则”所诉内容，用户如有违规推广行为，将依据“91疯狂猜违规推广处罚条例”的规定予以相应的不予结算、冻结业绩处罚。<br>
五、限制使用<br>
1. 用户如有下列行为之一的，91疯狂猜有权采取本《用户协议》所述措施中的一种或几种。给91疯狂猜造成经济损失的或者有损91疯狂猜商业信誉、企业形象的，91疯狂猜可以要求用户另行给予赔偿并公开赔礼道歉；构成国务院《著作权行政处罚实施办法》或者其他法律法规所规定的违法行为的，91疯狂猜将提请国家版权局等有关行政管理机关对用户进行行政处罚；构成犯罪的，91疯狂猜将向有关的司法机关举报，追究用户的刑事责任：违反本用户用户协议第4.10条约定，从事该条所列行为之一的；<br>
2. 用户如有本《用户协议》第5.1条所列行为的，91疯狂猜有权采取下列措施当中的一种或几种：<br>
（1）断线，即立即断开用户当前使用的计算机与91疯狂猜大厅服务器之间的网络连接，用户必须重新登录才能继续使用91疯狂猜大厅；<br>
（2）暂时封号，即暂时封停用户的游戏帐号，使之在封停期限内不能登录91疯狂猜大厅；<br>
（3）封停游戏角色，即暂时封停用户当前使用的游戏帐号项目下的某一个或者几个91疯狂猜的游戏角色，使之在封停期限内不能使用；<br>
（4）降级，即降低或者清除用户当前使用的游戏帐号在91疯狂猜大厅当中的积分、富贵豆、奖券、道具、等级和/或荣誉；<br>
（5）删除广告、虚假信息和/或非法言论，即永久性地、不可撤销地将用户发布的广告、虚假信息或者非法言论删除，或者采取其他的阻止其传播的措施；<br>
（6）删除赃物，即永久性地、不可撤销地将用户非法获取的富贵豆、奖券、元宝、游戏道具等游戏物品删除；<br>
（7）清零，即永久性地、不可撤销地将用户非法获取的富贵豆、奖券、元宝、游戏道具、等级和/或荣誉取消或清零；<br>
（8）永久禁言，即永久性地、不可撤销地禁止用户凭借当前使用的游戏帐号在91疯狂猜大厅当中发表任何言论；<br>
（9）拒绝受理帐号申诉，即拒绝向用户提供本《用户协议》第4.13条所述的客户服务和/或游戏帐号申诉服务，即便是该等服务是用户所需要的，并为用户所请求提供的；<br>
（10）禁止申请新的91疯狂猜帐号或者游戏帐号，即禁止用户通过申请或者其他任何方式取得新的91疯狂猜帐号，或者即便是可以申请取得91疯狂猜帐号，但申请取得的91疯狂猜帐号不能用作游戏帐号；<br>
（11）清空数据，即永久性地、不可撤销地删除用户当前使用的游戏帐号项下的某一游戏角色及依附于该游戏角色的所有富贵豆、奖券、元宝、游戏道具、积分、等级、荣誉等资料以及相应的游戏数据；<br>
（12）永久封号，即永久性地、不可撤销地禁止用户凭借在当前使用的91疯狂猜帐号登录91疯狂猜大厅，并删除、清空该91疯狂猜帐号在91疯狂猜当中产生的所有游戏数据、富贵豆、奖券、元宝、游戏道具、积分、等级、荣誉等资料，但用户仍可以凭借该91疯狂猜帐号正常消费91疯狂猜提供的其他的互联网服务；<br>
（13）回收帐号，即永久性地、不可撤销地禁止用户凭借当前使用的91疯狂猜帐号使用91疯狂猜提供的包括91疯狂猜在内的所有互联网服务，并将该91疯狂猜帐号回收；<br>
（14）其他措施，即采取上列措施之外的其他的措施。<br>
3. 91疯狂猜可能会通过在91疯狂猜大厅登录窗口及其官方网站或者其他的途径公布该游戏存在的BUG，一经公布，用户应当立即停止使用BUG的行为。否则，91疯狂猜可能会采取本《用户协议》第5.2条所述的第（2）、（3）、（15）项或第（16）项处理措施。即便是如此，亦不能免除在91疯狂猜公布之前用户负有的本《用户协议》第4.12条所述的第（3）项义务。换言之，即便是没有对外公布BUG，91疯狂猜也可以自行判断用户是否使用了BUG。而且，91疯狂猜一经判断用户使用了BUG，即可对用户当前使用的游戏帐号采取上述措施。<br>
4. 用户提请91疯狂猜提供本《用户协议》所述的客户服务时，如不按照约定提供相应的资料及证据的，91疯狂猜有权拒绝提供相应的客户服务。<br>
六、账号数据<br>      
1. 账号注册<br>
（1）在猜个球公司根据国家法律法规要求需要用户以真实身份注册成为猜个球公司游戏的用户时，用户应提供真实身份信息进行注册并保证所提供的个人身份资料信息真实、完整、有效，并依据法律规定和本条款约定对所提供的信息承担相应的法律责任。<br>
（2）账号和昵称注册应符合法律法规和社会公德的要求，不得以党和国家领导人或其他名人的真实姓名、字号、艺名、笔名和不文明、不健康用语注册。<br>
（3）用户以真实身份注册成为猜个球公司用户后，需要修改所提供的个人身份资料信息的，猜个球公司将及时、有效地为用户提供该项服务。<br>
（4）账户所有权归属于猜个球公司，用户享有该账户在游戏运营期间的使用权。<br>
2. 用户账号使用与保管<br>
猜个球公司有权审查用户注册所提供的身份信息是否真实、有效，并应积极地采取技术与管理等合理措施保障用户账号的安全、有效；用户有义务妥善保管其账号及密码，并根据猜个球公司的要求正确、安全地使用其账号及密码。因黑客行为或用户保管疏忽等非猜个球公司过错导致帐号、密码遭他人非法使用，猜个球公司不承担任何责任。<br>
（1）用户对登录后所持账号产生的行为依法享有权利和承担责任。<br>
（2）用户发现其账号或密码被他人非法使用或有使用异常的情况的，应及时通知猜个球公司，并有权通知猜个球公司采取措施暂停该账号的登录和使用。<br>
（3）猜个球公司根据用户的通知采取措施暂停用户账号的登录和使用的，猜个球公司有权要求用户提供并核实与其注册身份信息相一致的个人有效身份信息。用户没有提供其个人有效身份证件或者用户提供的个人有效身份证件与所注册的身份信息不一致的，猜个球公司有权拒绝用户上述请求。<br>
（4）用户由于密码过于简单，使其极易被破解或猜测出来而 造成的帐号损失，用户无权要求任何赔偿。<br>
（5）用户因忘记密码或密码被盗向客服查询密码时，须提供完全正确的注册信息，否则91疯狂猜有权本着为用户保密的原则不予告知。若用户将帐号与他人于现实生活中进行交易或互易行为而产生的纠纷，91疯狂猜概不负责。<br>
（6）用户使用在91疯狂猜注册的用户名在91疯狂猜中的任何行为需要遵守91疯狂猜其他各项服务条款。<br>
（7）用户连续六个月未使用在91疯狂猜注册的帐号或首次使用后三个月内再未使用过其帐号或注册后一个月内从未登陆使用过该帐号，经系统审查后，91疯狂猜有权采取措施终止该用户继续使用该帐号或回收该帐号。<br>
（8）用户对91疯狂猜服务管理人员所进行的询问应据实澄清，否则91疯狂猜有权随时终止用户使用服务。<br>
（9）用户所使用的手机号码只能绑定一个游戏账号，绑定成功后，将不能进行更换与解绑，如用户手机丢失、或以其他原因要求解绑，将不予受理。<br>
（10）用户的游戏账号在游戏当中的道具、奖券、等级、积分、元宝、荣誉等游戏物品，仅限本账号使用，不提供转给其他账号。<br>
（11）用户所有的线下交易行为都不受官方保护承诺，一切交易行为后果和责任都由用户自行承担<br>
（12）本公司按照本责任条款内的管理内容对用户帐号拥有所有管理权。不提供任何形式的用户退款服务，用户帐号充值发生错误，可提交相关充值信息给客服人员进行处理。用户账号充值发生错误，如元宝已被消耗，将不予赔偿<br>
（13）用户的游戏账号在游戏当中进行录像举报后，如对处理结果不满意，可向客服人员进行申诉，申诉的结果为最终判定结果。用户如对最终判定结果不满意，猜个球公司有权拒绝用户再次申诉请求。<br>
七、用户信息保护<br>
1. 猜个球公司将保护用户提供的有效个人信息数据的安全。不对外向任何第三方提供、公开或共享用户注册资料中的姓名、个人有效身份证件号码、联系方式、家庭住址等个人身份信息，但下列情况除外：<br>
（1）用户或用户监护人授权披露的；<br>
（2）有关法律要求披露的；<br>
（3）司法机关或行政机关基于法定程序要求提供的；<br>
（4）猜个球公司为了维护自己合法权益而披露；<br>
（5）应用户监护人的合法要求而提供用户个人身份信息时。<br>
八、服务的终止<br>
1. 用户实施或有重大可能实施以下行为的，猜个球公司有权中止对其部分或全部服务，中止提供服务的方式包括但不限于暂停对该账号的登录和使用、暂时禁止使用充值服务、暂时禁止兑换相应奖品、降低或者清除账号中的积分、富贵豆、奖券、元宝、游戏道具等、暂时禁止使用论坛服务：<br>
（1）私下进行买卖游戏道具的行为；<br>
（2）提供虚假注册身份信息的行为；<br>
（3）游戏中合伙作弊，尚未对其他用户利益造成严重影响的行为；<br>
（4）发布不道德信息、广告、言论、辱骂骚扰他人，扰乱正常的网络秩序和游戏秩序的行为；<br>
（5）实施违反本用户协议和相关规定、管理办法、公告、重要提示，对猜个球公司和其他用户利益造成损害的其他行为。<br>
2. 用户实施或有重大可能实施以下不正当行为的，猜个球公司有权终止对用户提供服务，终止提供服务的方式包括但不限于永久性的删除该账号、发表的帖子、留言、将非法所得的富贵豆、奖券、元宝、积分和荣誉道具清零：<br>
（1）发布违法信息、严重违背社会公德、以及其他违反法律禁止性规定的行为；<br>
（2）利用《91疯狂猜》进行赌博活动的行为；<br>
（3）涉嫌买卖偷盗的虚拟财产、游戏道具的行为；<br>
（4）游戏中合伙作弊对其他用户利益造成严重影响的行为；<br>
（5）用非法手段盗取其他用户账号和虚拟财产、游戏道具的行为；<br>
（6）论坛、游戏中传播非法讯息、木马病毒、外挂软件等的行为；<br>
（7）利用游戏作弊工具或者外挂、游戏bug获取非法利益，严重侵犯猜个球公司利益的行为；<br>
（8）实施违反本用户协议和相关规定、管理办法、公告、重要提示，对猜个球公司和其他用户利益造成严重损害的其他行为。<br>
3. 本用户协议中未涉及到的禁止或限制性行为及处罚规则，由猜个球公司针对具体服务制定相关规定、管理办法、公告、重要提示、指引、说明等，视为本用户协议之补充用户协议，为本用户协议不可分割之组成部分，具有本用户协议同等法律效力，接受本用户协议即视为用户自愿接受相关规定、管理办法、公告、重要提示、指引、说明等并受其约束。<br>
九、免责条款<br>
1. 用户之间因线上游戏行为所发生或可能发生的任何心理、生理上的伤害和经济上的损失，猜个球公司不承担任何责任。<br>
2. 用户因其个人原因造成账号资料保管不妥而导致个人信息数据被他人泄露或账号中虚拟财产、游戏道具被盗或损失的，猜个球公司不承担任何责任。<br>
3. 用户因除了按游戏规则进行游戏的行为外的其他行为触犯了中华人民共和国法律法规的，责任自负，91疯狂猜不承担任何责任。<br>
4. 用户账号长期不使用的，猜个球公司有权进行回收，因此带来的用户个人信息数据丢失、账户内虚拟财产和游戏道具清零等一切损失由用户个人承担，猜个球公司不承担任何责任。<br>
5. 用户因违反本用户协议8.1、8.2条款而被猜个球公司采取处罚措施所产生的一切损失包括但不限于富贵豆、奖券、元宝、游戏道具、积分、荣誉被清零、道具失效或其他损失，均由用户个人承担，猜个球公司不承担任何责任。<br>
6. 基于网络环境的复杂性，猜个球公司不担保服务一定能满足用户的要求，也不保证各项服务不会中断，对服务的及时性、安全性也不作担保。因网络安全、网络故障问题和其他用户的非法行为给用户造成的损失，91疯狂猜不承担任何责任。<br>
7. 基于网络环境的特殊性，猜个球公司不担保对用户限制性行为和禁止性行为的判断的准确性，用户因此产生的任何损失猜个球公司不承担任何责任，用户可按猜个球公司相关规定进行申诉解决。<br>
8. 猜个球公司不保证用户从第三方获得的猜个球公司虚拟货币、富贵豆等游戏物品能正常使用，也不保证该等物品不被索回，因私下购买虚拟货币等游戏物品所产生的一切损失均由用户承担，猜个球公司不承担任何责任。<br>
9. 91疯狂猜为了有效遏制91疯狂猜中用户使用BUG或外挂的行为，可能会采取停机维护或者回档的处理措施。停机维护期间，用户可能会不能登录91疯狂猜。回档，则是将所有用户游戏帐号项下的游戏数据从某一个时刻的记录返回到此前的另一个时刻的记录，由此可能会导致用户在这期间通过正常游戏行为获得的富贵豆、奖券、元宝、游戏道具等游戏物品和等级、积分、荣誉等永久性丧失，或者给用户造成其他的损失。对此，用户充分理解并愿意自行承担，91疯狂猜将不给予任何赔偿。<br>
10.  91疯狂猜可能会因91疯狂猜本身或者合作单位的互联网系统软硬件设备的故障、失灵、或人为操作的疏失而全部或一部分中断、暂时无法使用、迟延，或因他人侵入91疯狂猜系统篡改或伪造变造资料等，造成91疯狂猜的停止或中断者或用户档案缺失，用户不得要求91疯狂猜给予用户任何的补偿或赔偿。<br>
十、法律适用和争议解决<br>
本用户协议的订立、效力、解释、履行和争议的解决均适用中华人民共和国法律。因本用户协议所产生的以及因履行本用户协议而产生的任何争议，双方均应本着友好协商的原则加以解决。协商解决未果，任何一方有权向人民法院提请审理。<br>
十一、其他约定<br>
1. 91疯狂猜保留随时地、不事先通知地、不需要任何理由地、单方面地修订本《用户协议》的权利。本《用户协议》一经修订，91疯狂猜将会用修订后的用户协议版本完全替代修订前的用户协议版本，并通过原有方式向所有用户公布。用户应当及时关注和了解本《用户协议》的修订情况，如果用户不同意修订后用户协议版本，请用户立即停止使用和享受91疯狂猜产品及服务，否则即视同用户同意并完全接受修订后的用户协议版本。<br>
2. 91疯狂猜将本《用户协议》以对话框的形式内置于91疯狂猜客户端软件安装程序当中，用户在安装该客户端软件的过程中即可查阅、了解本《用户协议》，亦可以通过点击“我同意”或“我接受”表示用户完全同意并接受本《用户协议》之约束，或者点击“我不同意”或“我不接受”表示用户不同意本《用户协议》。如果用户不同意本 《用户协议》，请用户取消该按钮前面方框内的“√”，否则视同用户完全同意并接受本《用户协议》之约束。<br>
3.  91疯狂猜官方网站为：www.91fkc.com，您如对本《用户协议》条款有任何疑问或者需要帮助，可以通过上述网站或者电话与91疯狂猜联系。</p>
				</div>
			</div>
		</div>
		<form  id="form" action="http://trans.palmf.cn/sdk/api/v1.0/cli/order_h5/0" method="post">
			<input type="hidden" id="orderInfo" name="orderInfo" v-model="orderInfo">
		</form>
	</div>
</template>
<script>
  import { Group,Cell,XButton,XDialog,CheckIcon } from 'vux'
  import { appid, key } from '../assets/js/config'
  import md5 from 'md5'
  export default {
	data () {
		return {
			pageIndex: 1,
			list: [],
			showPay: false,
			showAgreement: false,
			isTipsInfoShow: false,
			payNum: 0,
			isAgree: true,
			orderInfo: ''
		}
	},
	computed: {
		memberInfo() {
			return JSON.parse(localStorage.getItem('memberInfo'))
		},
		isWX () {
			return this.isWeixin()
		}
	},
	created() {
		document.title = '获取金豆'
		this.getGoldBeanList()
		console.log(appid, key)
	},
	methods: {
		getGoldBeanList () {
			let URL = this.__WEBSERVERURL__ + '/api/shop/goldBeanType'
			this.$http.get(URL).then(res => {
				console.log(JSON.stringify(res.body))
				this.list = res.body.data.goldBeanTypeList
			})
		},
		showPayToast (goldBeanNum) {
			this.showPay = true
			this.payNum = goldBeanNum
		},
		buyGoldBean () {
			let params = {
				'appid': appid,
				'key': key,
				'subject': this.payNum + '金豆', // 商品名称,
				'amount': this.payNum, // 支付金额，单位/分,
				'mchntOrderNo': this.getTimeNum() + this.getVerCode(8), // 订单号,
				'body': '金豆',
				'childAppid': '',
				'clientIp': returnCitySN.cip,
				'payChannelId': '', // 支付方式,
				'notifyUrl': 'http://39.108.245.177:3000/api/notifyUtl',
				'returnUrl': window.location.origin + '/#/GetGoldBean',
				'type':'h5'
			}
			// console.log(JSON.stringify(params))
			let URL = this.__WEBSERVERURL__ + '/api/payOrder'
			this.$http.post(URL, params).then(res => {
				if (res.body.code == 0) {
					this.orderInfo = res.body.data
					this.$nextTick(() => {
						document.getElementById('form').submit()
					})
				}
			})
		},
		back () {
			this.$router.push({name: 'my'})
		}
	},
	components: {
		Group,
		Cell,
		XButton,
		XDialog,
		CheckIcon
	}
  }
</script>
<style lang="stylus" rel="stylesheet/stylus" scoped>
	.mygoldbean
		overflow hidden
		.header
			position fixed
			left 0
			top 0
			width 100%
			height 44px
			line-height 44px
			text-align center
			color #fff
			background-color #35495e
			position relative
			.back
				position absolute
				left 0
				top 0
				padding-left 20px
				font-size 14px
				i
					position absolute
					left 10px
					top 16px
					display block
					width 12px
					height 12px
					border-top 2px solid #fff
					border-left 2px solid #fff
					transform rotate(-45deg)
		.wrapper
			width 100%
			position absolute
			left 0
			top 0
			right 0
			.goldList
				width 100%
				.litleTitle
					color #999
					font-size 14px
					margin-top 0.77em
					margin-bottom 0.3em
					padding-left 15px
					padding-right 15px
				.goldUl
					background-color #fff
					padding 0 15px
					.goldLi
						display flex
						height 45px
						line-height 45px
						.icon
							display block
							width 20px
							flex 0 0 20px
						.num
							flex 1
							padding-left 5px
							.rmb
								color #bbb
								font-size 14px
								padding-left 10px
						.btn
							flex 0 0 70px
			.dialog-mask
				position fixed
				top 0
				left 0
				width 100%
				height 100%
				background-color rgba(0, 0, 0, .6)
			.dialog
				position fixed
				top 50%
				left 50%
				z-index 1000
				transform translate(-50% , -50%)
				-webkit-transform translate(-50% , -50%)
				width 80%
				background-color #fff
				text-align center
				border-radius 3px
				.closeDialog
					position absolute
					right 10px
					top 10px
					width 30px
					height 30px
					background-image url('../assets/img/close.svg')
					background-repeat no-repeat
					background-size 18px
					background-position center
				.dialog-title
					padding 1.3em 1.6em 0.5em
					strong
						font-weight 400
						font-size 18px
				.goldNum
					height 40px
					line-height 40px
					color #ff9928
					font-weight 400
				.tips
					margin-top 5px
					color #666
					font-size 12px
					height 30px
					line-height 30px
					i
						display inline-block
						width 16px
						height 16px
						background-image url('../assets/img/question.svg')
						background-repeat no-repeat
						background-size cover
						position relative
						left 5px
						top 3px
				.tipsInfo
					width 100%
					color #999
					font-size 12px
					padding 5px
					text-align left
					background-color #eee
					border-radius 5px
				.agreement
					font-size 12px
					height 40px
					line-height 40px
					position relative
					top 8px
					span
						color #4395FF
			.agreementDialog
				position fixed
				top 0
				left 0
				bottom 0
				z-index 1001
				width 100%
				background-color #fff
				text-align center
				.closeAgreementDialog
					position absolute
					right 10px
					top 10px
					z-index 99
					width 30px
					height 30px
					background-image url('../assets/img/close.svg')
					background-repeat no-repeat
					background-size 18px
					background-position center
				.agreementDialog-title
					padding 0.8em 1.6em 0.8em
					strong
						font-weight 400
						font-size 18px
</style>